Repository: duchuy129/lunarcalendar
Catalog: src/LunarCalendar.MobileApp/Resources/Strings/AppResources.*.resx
Languages: vi

# AppName
source: Lunar Calendar
vi: Lịch Âm

# WelcomeTagline
source: Track events across calendars
vi: Theo dõi sự kiện qua lịch dương và lịch âm

source: Continue as Guest
vi: Tiếp tục với tư cách Khách

source: Sign In
vi: Đăng nhập

source: Sign Up
vi: Đăng ký

# GuestModeInfo
source: Guest mode lets you view the calendar. Sign up to create and sync events.
vi: Chế độ khách cho phép bạn xem lịch. Đăng ký để tạo và đồng bộ sự kiện.

source: Calendar
vi: Lịch Vạn Niên

source: Previous month
vi: Tháng trước

source: Next month
vi: Tháng sau

source: Today
vi: Hôm nay

source: Go to today
vi: Đến hôm nay

# CurrentMonthYear
source: Current month and year
vi: Tháng và năm hiện tại

source: Sync status
vi: Trạng thái đồng bộ

source: Month:
vi: Tháng:

source: Go
vi: Đi

source: Select Month & Year
vi: Chọn Tháng & Năm

source: Select Month
vi: Chọn Tháng

source: Select Year
vi: Chọn Năm

# Sunday
source: Sun
vi: CN

# Monday
source: Mon
vi: T2

# Tuesday
source: Tue
vi: T3

# Wednesday
source: Wed
vi: T4

# Thursday
source: Thu
vi: T5

# Friday
source: Fri
vi: T6

# Saturday
source: Sat
vi: T7

# UpcomingHolidaysTitle
source: Upcoming Holidays (Next {0} Days)
vi: Ngày Lễ Sắp Tới ({0} Ngày Tiếp Theo)

# NoUpcomingHolidays
source: No upcoming holidays in this period
vi: Không có ngày lễ sắp tới trong khoảng thời gian này

source: Vietnamese Holidays
vi: Ngày Lễ Việt Nam

source: Gregorian Date
vi: Lịch Dương

source: Lunar Date
vi: Lịch Âm

source: Public Holiday
vi: Ngày Lễ Chính Thức

source: About This Holiday
vi: Về Ngày Lễ Này

source: Culture
vi: Văn Hóa

source: Settings
vi: Cài đặt

source: Display Settings
vi: Cài Đặt Hiển Thị

source: Cultural Background
vi: Hình Nền Văn Hóa

# CulturalBackgroundDesc
source: Display traditional Vietnamese cultural imagery
vi: Hiển thị hình ảnh văn hóa truyền thống Việt Nam

source: Show Lunar Dates
vi: Hiển Thị Ngày Âm Lịch

# ShowLunarDatesDesc
source: Display lunar calendar dates on calendar grid
vi: Hiển thị ngày âm lịch trên lưới lịch

source: Upcoming Holidays Range
vi: Phạm Vi Ngày Lễ Sắp Tới

# UpcomingHolidaysRangeDesc
source: Number of days to show upcoming holidays
vi: Số ngày hiển thị ngày lễ sắp tới

source: Language
vi: Ngôn Ngữ

# LanguageDesc
source: Choose your preferred language
vi: Chọn ngôn ngữ ưa thích của bạn

source: Interaction Settings
vi: Cài Đặt Tương Tác

source: Haptic Feedback
vi: Phản Hồi Xúc Giác

# HapticFeedbackDesc
source: Vibrate on button presses (iOS only)
vi: Rung khi nhấn nút (chỉ iOS)

# SyncAndOffline
source: Sync & Offline
vi: Đồng Bộ & Ngoại Tuyến

source: Connection Status
vi: Trạng Thái Kết Nối

source: Online
vi: Trực tuyến

source: Offline
vi: Ngoại tuyến

source: Last Sync
vi: Đồng Bộ Lần Cuối

source: Sync Now
vi: Đồng Bộ Ngay

source: Syncing...
vi: Đang đồng bộ...

# DataAndStorage
source: Data & Storage
vi: Dữ Liệu & Lưu Trữ

# ClearCache
source: Clear Cache & Offline Data
vi: Xóa Bộ Nhớ Đệm & Dữ Liệu Ngoại Tuyến

# ResetSettings
source: Reset All Settings
vi: Đặt Lại Tất Cả Cài Đặt

source: About
vi: Giới Thiệu

source: App Version
vi: Phiên Bản Ứng Dụng

source: About This App
vi: Về Ứng Dụng Này

source: Sync Complete
vi: Đồng Bộ Hoàn Tất

# SyncCompleteMessage
source: Calendar data has been synchronized successfully.
vi: Dữ liệu lịch đã được đồng bộ thành công.

source: Sync Failed
vi: Đồng Bộ Thất Bại

# SyncFailedMessage
source: Failed to synchronize calendar data. Please try again later.
vi: Không thể đồng bộ dữ liệu lịch. Vui lòng thử lại sau.

source: Sync Error
vi: Lỗi Đồng Bộ

# SyncErrorMessage
source: An error occurred during sync: {0}
vi: Đã xảy ra lỗi trong quá trình đồng bộ: {0}

# OfflineMessage
source: Cannot sync while offline. Please check your internet connection.
vi: Không thể đồng bộ khi ngoại tuyến. Vui lòng kiểm tra kết nối internet.

# ErrorTitle
source: Error
vi: Lỗi

source: Sync service not available
vi: Dịch vụ đồng bộ không khả dụng

source: Success
vi: Thành Công

# CacheClearedMessage
source: Cache and offline data cleared successfully
vi: Đã xóa bộ nhớ đệm và dữ liệu ngoại tuyến thành công

# ClearCacheError
source: Failed to clear cache: {0}
vi: Không thể xóa bộ nhớ đệm: {0}

# AboutMessage
source: Vietnamese Lunar Calendar A beautiful calendar app that displays both Gregorian and Vietnamese Lunar dates with traditional holidays. © 2025 All rights reserved.
vi: Lịch Âm Việt Nam Ứng dụng lịch đẹp hiển thị cả lịch dương và lịch âm Việt Nam cùng các ngày lễ truyền thống. © 2025 Bản quyền đã được bảo hộ.

# ResetSettingsTitle
source: Reset Settings
vi: Đặt Lại Cài Đặt

# ResetSettingsMessage
source: Are you sure you want to reset all settings to default values?
vi: Bạn có chắc chắn muốn đặt lại tất cả cài đặt về giá trị mặc định không?

# SettingsResetMessage
source: Settings have been reset to default values
vi: Đã đặt lại cài đặt về giá trị mặc định

source: Yes
vi: Có

source: No
vi: Không

source: Cancel
vi: Hủy

source: Just now
vi: Vừa xong

# MinutesAgo
source: {0} minutes ago
vi: {0} phút trước

# HoursAgo
source: {0} hours ago
vi: {0} giờ trước

source: Never
vi: Chưa bao giờ

source: January
vi: Tháng Một

source: February
vi: Tháng Hai

source: March
vi: Tháng Ba

source: April
vi: Tháng Tư

source: May
vi: Tháng Năm

source: June
vi: Tháng Sáu

source: July
vi: Tháng Bảy

source: August
vi: Tháng Tám

source: September
vi: Tháng Chín

source: October
vi: Tháng Mười

source: November
vi: Tháng Mười Một

source: December
vi: Tháng Mười Hai

# LanguageEnglish
source: English
vi: English (Tiếng Anh)

# LanguageVietnamese
source: Tiếng Việt (Vietnamese)
vi: Tiếng Việt

source: Restart Required
vi: Yêu Cầu Khởi Động Lại

# RestartRequiredMessage
source: Please restart the app to apply the new language.
vi: Vui lòng khởi động lại ứng dụng để áp dụng ngôn ngữ mới.

# UpcomingHolidaysFormat
source: Upcoming Holidays (Next {0} Days)
vi: Ngày Lễ Sắp Tới ({0} Ngày)

# NoUpcomingHolidaysMessage
source: No upcoming holidays in this period
vi: Không có ngày lễ sắp tới trong khoảng thời gian này

# LunarLabel
source: Lunar:
vi: Âm Lịch:

source: Year of the
vi: Năm

# AnimalRat
source: Rat
vi: Tý

# AnimalOx
source: Ox
vi: Sửu

# AnimalTiger
source: Tiger
vi: Dần

# AnimalRabbit
source: Rabbit
vi: Mão

# AnimalDragon
source: Dragon
vi: Thìn

# AnimalSnake
source: Snake
vi: Tỵ

# AnimalHorse
source: Horse
vi: Ngọ

# AnimalGoat
source: Goat
vi: Mùi

# AnimalMonkey
source: Monkey
vi: Thân

# AnimalRooster
source: Rooster
vi: Dậu

# AnimalDog
source: Dog
vi: Tuất

# AnimalPig
source: Pig
vi: Hợi

source: Major Day
vi: Ngày Trọng Đại

source: Traditional Festival
vi: Lễ Hội Truyền Thống

source: Seasonal Celebration
vi: Lễ Kỷ Niệm Theo Mùa

# Holiday_TetNguyenDan1_Name
source: Lunar New Year (Day 1)
vi: Tết Nguyên Đán (Mùng 1)

# Holiday_TetNguyenDan1_Description
source: Lunar New Year - The most important Vietnamese holiday celebrating the beginning of spring and the new lunar year
vi: Tết Âm Lịch - Ngày lễ quan trọng nhất của người Việt Nam, đánh dấu sự khởi đầu của mùa xuân và năm âm lịch mới

# Holiday_TetNguyenDan2_Name
source: Lunar New Year (Day 2)
vi: Tết Nguyên Đán (Mùng 2)

# Holiday_TetNguyenDan2_Description
source: Second day of Lunar New Year - Continuation of family celebrations and ancestral worship
vi: Ngày thứ hai của Tết Nguyên Đán - Tiếp tục các buổi họp mặt gia đình và thờ cúng tổ tiên

# Holiday_TetNguyenDan3_Name
source: Lunar New Year (Day 3)
vi: Tết Nguyên Đán (Mùng 3)

# Holiday_TetNguyenDan3_Description
source: Third day of Lunar New Year - Final day of the main Tet celebrations
vi: Ngày thứ ba của Tết Nguyên Đán - Ngày cuối cùng của các ngày Tết chính

# Holiday_HungKings_Name
source: Hung Kings' Commemoration Day
vi: Giỗ Tổ Hùng Vương

# Holiday_HungKings_Description
source: Commemorating the Hung Kings, the legendary founders of Vietnam
vi: Tưởng nhớ các vua Hùng, những người sáng lập huyền thoại của Việt Nam

# Holiday_NewYear_Name
source: New Year's Day
vi: Tết Dương Lịch

# Holiday_NewYear_Description
source: International New Year's Day - The first day of the Gregorian calendar year
vi: Ngày đầu tiên của năm dương lịch quốc tế

# Holiday_ReunificationDay_Name
source: Reunification Day
vi: Ngày Giải Phóng Miền Nam

# Holiday_ReunificationDay_Description
source: Celebrating the reunification of Vietnam on April 30, 1975
vi: Kỷ niệm ngày thống nhất đất nước vào ngày 30 tháng 4 năm 1975

# Holiday_LaborDay_Name
source: International Labor Day
vi: Ngày Quốc Tế Lao Động

# Holiday_LaborDay_Description
source: Honoring workers and the labor movement worldwide
vi: Tôn vinh người lao động và phong trào lao động trên toàn thế giới

# Holiday_NationalDay_Name
source: National Day
vi: Quốc Khánh

# Holiday_NationalDay_Description
source: Celebrating Vietnam's Declaration of Independence on September 2, 1945
vi: Kỷ niệm Tuyên Ngôn Độc Lập của Việt Nam vào ngày 2 tháng 9 năm 1945

# Holiday_LanternFestival_Name
source: Lantern Festival
vi: Tết Nguyên Tiêu

# Holiday_LanternFestival_Description
source: First full moon of the lunar year - A time for lantern displays and family gatherings
vi: Rằm tháng Giêng âm lịch - Thời gian trưng bày đèn lồng và sum họp gia đình

# Holiday_ColdFood_Name
source: Cold Food Festival
vi: Tết Hàn Thực

# Holiday_ColdFood_Description
source: Traditional festival honoring ancestors, observed by eating cold food
vi: Lễ hội truyền thống tưởng nhớ tổ tiên, được tổ chức bằng cách ăn đồ ăn lạnh

# Holiday_DragonBoat_Name
source: Dragon Boat Festival
vi: Tết Đoan Ngọ

# Holiday_DragonBoat_Description
source: Festival to ward off evil spirits and diseases, celebrated with special foods
vi: Lễ hội xua đuổi tà ma và bệnh tật, được tổ chức với các món ăn đặc biệt

# Holiday_Ullambana_Name
source: Vu Lan Festival
vi: Vu Lan

# Holiday_Ullambana_Description
source: Buddhist festival honoring parents and ancestors, especially mothers
vi: Lễ hội Phật giáo tôn vinh cha mẹ và tổ tiên, đặc biệt là mẹ

# Holiday_MidAutumn_Name
source: Mid-Autumn Festival
vi: Tết Trung Thu

# Holiday_MidAutumn_Description
source: Children's festival celebrating the harvest moon with lanterns and mooncakes
vi: Lễ hội của thiếu nhi, kỷ niệm trăng thu với đèn lồng và bánh trung thu

# Holiday_DoubleNinth_Name
source: Double Ninth Festival
vi: Tết Trùng Cửu

# Holiday_DoubleNinth_Description
source: Traditional festival on the ninth day of the ninth lunar month, honoring elders
vi: Lễ hội truyền thống vào ngày chín tháng chín âm lịch, tôn vinh người cao tuổi

# Holiday_FirstFullMoon_Name
source: First Full Moon
vi: Rằm Tháng Giêng

# Holiday_FirstFullMoon_Description
source: First full moon of the lunar year - A time for lantern displays and family gatherings
vi: Rằm đầu tiên của năm âm lịch - Thời gian trưng bày đèn lồng và sum họp gia đình

# Holiday_TombSweeping_Name
source: Tomb Sweeping Festival
vi: Tết Thanh Minh

# Holiday_TombSweeping_Description
source: Time to visit and clean ancestral graves, honoring deceased family members
vi: Thời gian viếng và dọn dẹp mộ tổ tiên, tưởng nhớ các thành viên gia đình đã khuất

# Holiday_GhostFestival_Name
source: Ghost Festival
vi: Rằm Tháng Bảy

# Holiday_GhostFestival_Description
source: Festival for wandering souls and ancestral spirits during the seventh lunar month
vi: Lễ hội cho các linh hồn lang thang và tổ tiên trong tháng bảy âm lịch

# Holiday_KitchenGods_Name
source: Kitchen Gods Festival
vi: Tết Ông Công Ông Táo

# Holiday_KitchenGods_Description
source: Sending the Kitchen Gods to heaven to report on the family's year
vi: Tiễn Ông Táo về trời để báo cáo về năm của gia đình

# Holiday_NewYearsEve_Name
source: Lunar New Year's Eve
vi: Giao Thừa

# Holiday_NewYearsEve_Description
source: The eve of Lunar New Year - Family reunion and welcoming the new year
vi: Đêm giao thừa - Đoàn tụ gia đình và đón năm mới

# LunarSpecialDay_FirstDay_Name
source: First Day
vi: Mùng 1

# LunarSpecialDay_FirstDay_Description
source: The first day of the lunar month - A time for new beginnings and fresh starts
vi: Ngày đầu tháng âm lịch - Thời điểm khởi đầu mới và những khởi sự tốt lành

# LunarSpecialDay_FullMoon_Name
source: Full Moon Day
vi: Rằm

# LunarSpecialDay_FullMoon_Description
source: The 15th day of the lunar month - Full moon day, traditionally a time for prayers and offerings
vi: Ngày 15 tháng âm lịch - Ngày trăng tròn, truyền thống là thời gian cầu nguyện và dâng lễ

source: Lunar Special Day
vi: Ngày Đặc Biệt Âm Lịch
